/**  任务2.LED流水灯  **/
//==声明区============================================
#include <reg51.h>  			// 将头文件“reg51.h"包含进来 
#define	LED	P0					// 定义LED接至P0口
void delay1ms(int);				// 声明延迟函数 

//==主程序============================================
main()							// 主程序开始 
{	unsigned char i;  			// 声明无号数字元变量i 	
	while(1)					// 无穷循环,程序一直跑 
	{	
		LED=0xfe;				// 初值=1111 1110,只有最右1盏灯亮	
		for(i=0;i<8;i++)		// 左移7次 
		{	delay1ms(500);		// 延迟500ms 
			LED=(LED<<1)|0x01;	// 左移1位,并设定最低位为1 
		}						// 左移结束,只有最左1盏灯亮 
	}							// while循环结束 
}								// 主程序结束
 
//==子程序=============================================
/* 延迟函数,延迟约x毫秒 */
void delay1ms(int x)			// 延迟函数开始 
{	int i,j;					// 声明整数变数i,j 
	for (i=0;i<x;i++)			// 计数x次,延迟x毫秒 
		for (j=0;j<120;j++);	// 计数120次，延迟1毫秒（与12晶振对应）
}								// 延迟函数结束