/** 任务7.按键控制LED灯亮和灭 **/
//==声明区=====================================
#include	<reg52.h> 		//	定义头文件
sbit  SB1=P3^2;				//	声明SB1接至P3.2
sbit  LED=P0^0;				//	声明LED接至P0.0
void  delay20ms();			//	声明延时20ms函数 
//==主程序=====================================
main() 						//	主程式开始 		
{	LED=1;					//	关闭LED
	SB1=1;					//	设置P3.2为输入口
	while(1)				//	无穷循环 
	{	if (SB1==0)  		//	若按下SB1
		{	delay20ms();	//	调用延时20ms函数(按下时)
			LED=!LED;		//	切换LED为反相 
			while(SB1!= 1);	//	若仍按住SB1，继续等 
			delay20ms();	//	调用延时20ms函数(放开时)
		}					//	if叙述结束 
	}						//	while循环结束 
} 							//	主程序结束 
//==子程序=====================================
/* 延时20ms函数函数,延迟约20ms */
void delay20ms()			//	延时20ms函数开始 
{	int i;					//	声明整数变数i 
	for(i=0;i<2400;i++);	//	计数2400次,延迟约20ms 
}							//	延时20ms函数结束