/** 任务11.用定时器T0中断控制led灯闪烁 **/
//==声明区================================
#include <reg52.h>				// 定义头文件
#define	LED	P0					// 定义LED接至P0
#define	count 50000				// T0(MODE 1)之计量值,约50ms 
#define TH_M1 (65636-count)/256	// T0定时初值高8位，等效为256进制的十位 
#define TL_M1 (65636-count)%256	// T0定时初值低8位，等效为256进制的个位 
unsigned char  Count_T=0;		// 宣告IntCount变数,计算T0中断次数 
//==主程序================================
main()							// 主程序开始 
{	IE=0x82;					// 启用T0中断
	TMOD=0x01;					// 设定T0为mode 1
	TH0=TH_M1;					// 设置T0定时初值高8位
	TL0=TL_M1;					// 设置T0定时初值低8位
	TR0=1;						// 启动T0
	LED=0xf0;					// LED初值=1111 0000,右4灯亮 
	while(1);					// 无穷循环，程序停滞 
}								// 主程序结束 
//== T0中断子程序- 每中断5次,LED反相 ================
void timer0(void) interrupt 1	// T0中断子程序开始 
{	TH0=TH_M1; TL0=TL_M1;		// 设置T0计数量高8位元、低8位元 
	if (++Count_T==5)			// 若T0已中断5次,即共定时了5*50=250ms 
	{	Count_T=0;				// 重新计次 
		LED=~LED;				// 输出相反 
	}							// if叙述结束 
}								// T0中断子程序