/**任务3.通过继电器控制外部灯2s闪烁一次**/
//==声明区============================================
#include	"reg52.h"  		// 将头文件“reg52.h"包含进来 
sbit lamp=P3^7;				// 声明变量led指向单片机的P3.7口
void delay1ms(int);			// 声明延迟函数 

//==主程序============================================
main()						// 主程序开始 
{	while(1)				// 无穷循环
	{
	 	lamp=1;				// P3.7设置为高电平
		delay1ms(500);		// 延时500ms
	 	lamp=0;				// P3.7设置为低电平
		delay1ms(2000);		// 延时2s
	}
}							// 主程序结束
 
//==子程序=============================================
/* 延迟函数,延迟约x ms */
void delay1ms(int x)		// 延迟函数开始 
{	int i,j;				// 声明整数变数i,j 
	for (i=0;i<x;i++)		// 计数x次,延迟x ms 
		for (j=0;j<120;j++);// 计数120次，延迟1ms 
}							// 延迟函数结束 