/** 任务5.驱动7段数码管循环显示0-9  **/
#include	<reg51.h> 		// 定义头文件 
char code TAB[10]={	0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x83,0xf8,0x80,0x98};	//共阳7段数码管,数字0-9的段码
void delay1ms(int);			//	声明延迟函数 
//==主程序=====================================
main()						//	主程序开始 
{	unsigned char i;		//	声明无号数字元变数i
	P2=0xf7;				//	P2.3为0，最右边数码管显示
	while(1)				//	无穷循环,程序一直跑 
	{
		for(i=0;i<10;i++)	//	显示0-9,共10次 
		{	
			P0=TAB[i];		//	显示数字 
			delay1ms(500);	//	延迟500ms 
		}					//	for循环结束
	}						//	while循环结束
}							//	主程序结束 
//==子程序=====================================
/* 延迟函数,延迟约x 1ms */
void delay1ms(int x)		//	延迟函数开始 
{	int i,j;				//	声明整数变数i,j 
	for (i=0;i<x;i++)		//	计数x次,延迟x 1ms 
		for (j=0;j<120;j++);//	计数120次，延迟1ms 
}							//	延迟函数结束